app/controllers/authentication_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "lsjfkldsj@lsdjfkldsj.com"], ["LIMIT", 1]]
---
  def register
    user = User.create!(email: params[:email], password: params[:password])
    if user.present? && user.valid_password?(params[:password])

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "lsjfkldsj@lsdjfkldsj.com"], ["LIMIT", 1]]
---
  def authenticate_user
    user = User.find_for_database_authentication(email: params[:email])