app/controllers/users_controller.rb

  def add_books
    @current_user.books_read = params[:books_read]
    if @current_user.save
---
UPDATE "users" SET "books_read" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["books_read", nil], ["updated_at", 2016-10-31 19:34:29 UTC], ["id", 13]]